app/Controllers/ClienteController.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $data['clientes'] = $this->clienteModel->findAll();