app/Controllers/FornecedorController.php

    public function index()
    {
        $data['fornecedores'] = $this->fornecedorModel->findAll();
---
SELECT *
FROM `fornecedores`