app/Controllers/Fornecedores.php

    public function index()
    {
        $model = new FornecedorModel();
        $data['fornecedores'] = $model->findAll();
---
SELECT *
FROM `fornecedores`